# -*- coding: utf-8 -*-
"""
    File    :chinese_data.py
    Author  :JiaLi.Ou   <109553196@qq.com>
    Note    :Font library used for generating statements
"""
# common_chinese_chars = (
#     "的一是了我不在人们有来他这上着个为到说要就出会可也你对生能而子那得于下自之年过发后作里用道行所然家种事成方多经么去法学如都同现当没动面起看定天分还进好小部其些主样理心她本前开但因只从想实日军者意无力它与长把机十民第公此已工使情明性知全三又关点正业外将两高间由问很最重并物手应战向头文体政美相见被利什二等产或新己制身果加西斯月话合回特代内信表化老给世位次度门任常先海通教儿原东声提立及比员解水名真论处走义各入几口认条平系气题活尔更别打女变四神总何电数安少报才结反受目太量再感建务做接必场件计管期市直德资命山金指克许统区保至队形社便空决治展马科司五基眼书非则听白却界达光放强即像难且权思王象完设式色路记南品住告类求据程北边死张该交规万取拉格望觉术领共确传师观清今切院让识带导争运笑飞风收根干每济车亲极林服快办议往元英士证近律般构层器效调团研超帮置积整罗参备维础值温落职流连镇互较华显刚标扩"
#     # 可以继续添加更多常用汉字
# )

common_chinese_chars = (
    "的好把她拉上车社会发展定看到我做人事去其真正意整体问题些识这都知道参与他们战场英几年过了记被一代文明所第二次世界确是还实在打也不干多等同家使生活更加为民主义现科学高最后你什么用自己可没住手运带回身边美得无头感觉很产空气想已经数变口声说起来少刚有命着争论要能让证点理应当领开决给军个才快因化受那每相完全眼前切老师电话情导积极进取向之只难张力公就它天常路直往处成风而连又里即思总流种下方法间见便今必办各三长果从出特对动别飞于类走目标望清水落或听再心许然认关行交光面调信至象接近传建如门两像小女北部性设司教样立市期则新以根万本该安月系厦区秦墨染刘双山治保低制肖博油牛逼大四字五1234567890CARYSENLKUHIOXMB"
)


print(f"char_num:{len(common_chinese_chars)}")



